TexasInstruments/mcupsdk-core/examples/drivers/adc/adc_high_priority_soc/am263px-lp/r5fss0-0_nortos/example.syscfg
mpu_armv72.$name             = "CONFIG_MPU_REGION1";
mpu_armv72.size              = 15;
mpu_armv72.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv73.$name             = "CONFIG_MPU_REGION2";
mpu_armv73.baseAddr          = 0x80000;
mpu_armv73.size              = 15;
mpu_armv73.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv74.$name             = "CONFIG_MPU_REGION3";
mpu_armv74.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv74.baseAddr          = 0x70000000;
mpu_armv74.size              = 21;

int_xbar1.$name      = "CONFIG_INT_XBAR0";
int_xbar1.xbarOutput = ["ADC4_INT1"];

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
adc1.ADC.AIN0.$suggestSolution          = "ball.V15";
adc1.ADC.AIN1.$suggestSolution          = "ball.U15";
adc1.ADC.AIN2.$suggestSolution          = "ball.T14";
adc1.ADC.AIN3.$suggestSolution          = "ball.U14";
adc1.ADC.AIN4.$suggestSolution          = "ball.U13";
adc1.ADC.AIN5.$suggestSolution          = "ball.R14";
adc2.ADC.AIN0.$suggestSolution          = "ball.T11";
adc2.ADC.AIN1.$suggestSolution          = "ball.U11";
adc2.ADC.AIN2.$suggestSolution          = "ball.T12";
adc2.ADC.AIN3.$suggestSolution          = "ball.V12";
adc2.ADC.AIN4.$suggestSolution          = "ball.U12";
adc2.ADC.AIN5.$suggestSolution          = "ball.R12";
adc3.ADC.AIN0.$suggestSolution          = "ball.R10";
adc3.ADC.AIN1.$suggestSolution          = "ball.T10";
adc3.ADC.AIN2.$suggestSolution          = "ball.U10";
adc3.ADC.AIN3.$suggestSolution          = "ball.T9";
adc3.ADC.AIN4.$suggestSolution          = "ball.V9";
adc3.ADC.AIN5.$suggestSolution          = "ball.T8";
adc4.ADC.AIN0.$suggestSolution          = "ball.U7";
adc4.ADC.AIN1.$suggestSolution          = "ball.U8";
adc4.ADC.AIN2.$suggestSolution          = "ball.T7";
adc4.ADC.AIN3.$suggestSolution          = "ball.R7";
adc4.ADC.AIN4.$suggestSolution          = "ball.V8";
adc4.ADC.AIN5.$suggestSolution          = "ball.U9";
adc5.ADC.AIN0.$suggestSolution          = "ball.U6";
adc5.ADC.AIN1.$suggestSolution          = "ball.V5";
adc5.ADC.AIN2.$suggestSolution          = "ball.V4";
adc5.ADC.AIN3.$suggestSolution          = "ball.U5";
adc5.ADC.AIN4.$suggestSolution          = "ball.V3";
adc5.ADC.AIN5.$suggestSolution          = "ball.U4";
epwm1.EPWM.A.$suggestSolution           = "ball.B2";
epwm1.EPWM.B.$suggestSolution           = "ball.B1";
debug_log.uartLog.UART.$suggestSolution = "UART0";
